//This Source Code Form is subject to the terms of the 
//Mozilla Public License, v.2.0. If a copy of the MPL 
//was not distributed with this file, You can obtain one 
//at http://mozilla.org/MPL/2.0/.
Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт

	Appveyor = ВРЕГ(ПолучитьПеременнуюСреды("APPVEYOR")) = ВРЕГ("True");
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_СоздатьСоединение");

	Если НЕ Appveyor Тогда
		ВсеТесты.Добавить("ТестДолжен_ОтправитьФайл");
	КонецЕсли;

	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_СоздатьСоединение() Экспорт

	Соединение = Новый FtpСоединение("localhost");

КонецПроцедуры

Процедура ТестДолжен_ОтправитьФайл() Экспорт

	Таймаут = 15;

	ПроверочнаяСтрока = "123";

	ИмяФайла = ПолучитьИмяВременногоФайла("txt");
	Файл = Новый Файл(ИмяФайла);
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(ПроверочнаяСтрока);
	ТД.Записать(ИмяФайла);
	
	// https://dlptest.com/ftp-test/
	// Пользователь и пароль публичны
	Соединение = Новый FtpСоединение("ftp.dlptest.com",, "dlpuser", "rNrKYTX9g7z3RgJRmxWuGHbeu",,, Таймаут);
	Соединение.Записать(ИмяФайла, "/" + Файл.Имя);

	ИмяФайлаПолучателя = ПолучитьИмяВременногоФайла("txt");
	Соединение.Получить("/" + Файл.Имя, ИмяФайлаПолучателя);

	ТД.Прочитать(ИмяФайлаПолучателя);

	юТест.ПроверитьРавенство(ПроверочнаяСтрока, СокрП(ТД.ПолучитьТекст()));
	
КонецПроцедуры
